{
    "announcement": "<h2><strong>期中考注意事項</strong></h2><ul><li><p>考試時間： <strong>09:10 - 12:10 (三小時)</strong></p></li><li><p>考題總共有 6 題，<strong>滿分為 120 分</strong>。分別是兩題 Easy 25 分、兩題 Medium 20 分、兩題 Hard 15 分。</p></li><li><p>進入考場時請向助教領取<strong>考試密碼 (token)</strong>，在進入考試頁面時會需要輸入這個密碼。輸入完密碼後，該密碼就會失效，<strong>如非必要，在考試結束前請勿登出你的帳號，也不要切換其它瀏覽器或機器使用</strong>。</p></li><li><p>考試過程僅允許使用</p><ul><li><p>程式開發環境（如：CLion, VSCode, Code Block, Dev C++ 等，<strong>不包含 ideone 等線上編譯器</strong>！）</p></li><li><p>CK Judge 平台（可使用自己曾經繳交過的程式碼，考試期間內無法使用討論版）</p></li><li><p><a href=\"https://ckj.imslab.org/document/c.html\" rel=\"noopener noreferrer nofollow\">C 語言開發者文件</a></p></li><li><p>老師上課投影片</p></li><li><p>自己的筆記 25 頁 A4</p></li></ul></li><li><p>考試過程中不得開啟不在上列的應用程式或外部資源，不得翻閱任何教科書或課本、不得使用平板、手機等可上網的裝置，亦不得以任何手段與其他人進行通訊。<strong>若有違反，則視為當下交卷，需立刻離開試場</strong>。自行攜帶筆電的同學請先行關閉通訊軟體通知功能，顯示通知訊息視同使用通訊軟體。</p></li><li><p><strong>禁止使用程式碼自動撰寫工具</strong>，包含並不限於：Github Copilot, Tabnine, IntelliCode 等。若同學有使用此工具，請在考前將相關 extension 解除安裝。考試期間助教將抽查。</p></li><li><p><strong>嚴禁作弊</strong>。所有同學的程式碼在考試結束後都會放入程式碼比對系統中進行交叉比對，若有作弊情事發生，一律依校規從嚴處置。</p></li></ul><p></p><h2><strong>Midterm Announcement</strong></h2><ul><li><p>Time: <strong>09:10 - 12:10 (three hours).</strong></p></li><li><p>There will be 6 questions in the exam. <strong>Total score is 120</strong>, with 2 easy questions (25 pt), 2 medium questions (20 pt), 2 hard questions (15 pt).</p></li><li><p>We will give you an <strong>access token</strong> to the exam page before the exam starting. After you enter the token, it will become invalid. <strong>So make sure you don’t logout your account or change your browser before you finish the exam.</strong></p></li><li><p>During the exam, you’re only allowed to use:</p><ul><li><p>The developing environment (e.g. CLion, VSCode, Code Block, Dev C++. <strong>Online compiler such as ideone are not allowed</strong>)</p></li><li><p>CK Judge (You can use the code submitted to homework, but cannot use discussion forum)</p></li><li><p><a href=\"https://ckj.imslab.org/document/c.html\" rel=\"noopener noreferrer nofollow\">C language document</a></p></li><li><p>Course slides</p></li><li><p>Your note, A4 paper 25 page</p></li></ul></li><li><p>During the exam, you are not allowed to use any other website / applications not mentioned above, not allowed to refer to any textbook, not allowed to use your smartphone or tablet, and not allowd to communicate with others in any forms. <strong>If any of these rules are violated, you’ll be asked to leave the classroom immediately.</strong> Anyone who use their own laptop should turn off notifications from communication apps, any notifications will be considered illegal use of apps.</p></li><li><p><strong>Any code autocomplete extensions are not allowed</strong> as well. If you are using this kind of tools, make sure you uninstall them before the exam. We will spot check during the exam.</p></li><li><p><strong>No cheating</strong>. We will inspect your code using plagiarism detection system after the exam. Anyone who cheats on the exam will be processed according to the college regulations and get zero point.</p></li></ul>",
    "meetingUrl": "",
    "requireVerification": false,
    "startTime": "2022-11-17T01:00:00.000Z",
    "dueTime": "2022-11-17T04:00:00.000Z",
    "sections": [],
    "type": "Exam",
    "index": "midterm-2022",
    "title": "Midterm 2022"
}